<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Etcher disk image.</string>
    <key>Identifier</key>
    <string>com.github.jeremylarose.download.Etcher</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Etcher</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.2</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://github.com/balena/etcher/releases</string>
                <key>re_pattern</key>
                <string>/balena/etcher/releases/tag/v(?P&lt;version&gt;[\S]+)"</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://github.com/balena/etcher/releases/download/v%version%/Etcher-%version%.dmg</string>
            </dict>
        </dict>

        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Etcher.app</string>
                <key>requirement</key>
                <string>anchor apple generic and identifier "io.resin.etcher" and (certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "66H43P8FRG")</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
