<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Etcher disk image.</string>
    <key>Identifier</key>
    <string>com.github.jeremylarose.download.Etcher</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Etcher</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.2</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://github.com/resin-io/etcher/releases</string>
                <key>re_pattern</key>
                <string>href="https://resin-production-downloads.s3.amazonaws.com/etcher/(?P&lt;version&gt;[\S]+)/[\S]+darwin-x64.dmg"</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://resin-production-downloads.s3.amazonaws.com/etcher/%version%/Etcher-%version%-darwin-x64.dmg</string>
            </dict>
        </dict>

        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
    				<key>Processor</key>
    				<string>CodeSignatureVerifier</string>
    				<key>Arguments</key>
    				<dict>
    						<key>input_path</key>
    						<string>%pathname%/Etcher.app</string>
    						<key>expected_authority_names</key>
    						<array>
    								<string>Developer ID Application: Rulemotion Ltd (66H43P8FRG)</string>
    								<string>Developer ID Certification Authority</string>
    								<string>Apple Root CA</string>
    						</array>
    				</dict>
    		</dict>
    </array>
</dict>
</plist>
