<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest UrBackupClient package.</string>
    <key>Identifier</key>
    <string>com.github.jeremylarose.download.UrBackupClient</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>UrBackupClient</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.2</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.urbackup.org/download.html</string>
                <key>re_pattern</key>
                <string>href="http://hndl.urbackup.org/Client/(?P&lt;major_version&gt;[\d\.]+)/UrBackup%20Client%20(?P&lt;version&gt;[\d\.]+).pkg"</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://hndl.urbackup.org/Client/%major_version%/UrBackup%20Client%20%version%.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
    				<key>Processor</key>
    				<string>CodeSignatureVerifier</string>
    				<key>Arguments</key>
    				<dict>
    						<key>input_path</key>
    						<string>%pathname%</string>
    						<key>expected_authority_names</key>
    						<array>
    								<string>DDeveloper ID Installer: Infscape UG (haftungsbeschr?nkt) (3Y4WACCWC5)</string>
    								<string>Developer ID Certification Authority</string>
    								<string>Apple Root CA</string>
    						</array>
    				</dict>
    		</dict>
    </array>
</dict>
</plist>
