<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest OpenShot disk image.</string>
    <key>Identifier</key>
    <string>com.github.jeremylarose.download.OpenShot</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>OpenShot</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.2</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://www.openshot.org/download/</string>
                <key>re_pattern</key>
                <string>href="http://github.com/OpenShot/openshot-qt/releases/download/v(?P&lt;major_version&gt;[\d\.]+)/OpenShot-v(?P&lt;full_version&gt;[\d\.]+)-x86_64.dmg"</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%-%full_version%.dmg</string>
                <key>url</key>
                <string>http://github.com/OpenShot/openshot-qt/releases/download/v%major_version%/OpenShot-v%full_version%-x86_64.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
