<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Downloads the latest version of OpenShot Video Editor and imports it into Munki</string>
	<key>Identifier</key>
	<string>com.github.jeremylarose.munki.OpenShot</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>OpenShot</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>OpenShot Video Editor is a free, open-source video editor for Linux licensed under the GPL version 3.0. </string>
			<key>developer</key>
			<string>OpenShot</string>
			<key>display_name</key>
			<string>OpenShot Video Editor</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.jeremylarose.download.OpenShot</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>AppDmgVersioner</string>
		</dict>
		<dict>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>installs</key>
                    <array>
                        <dict>
                            <key>CFBundleIdentifier</key>
                            <string>com.openshot.openshot</string>
                            <key>CFBundleName</key>
                            <string>OpenShot Video Editor</string>
                            <key>CFBundleShortVersionString</key>
                            <string>%version%</string>
                            <key>CFBundleVersion</key>
                            <string>%version%</string>
                            <key>path</key>
                            <string>/Applications/OpenShot Video Editor.app</string>
                            <key>type</key>
                            <string>application</string>
                            <key>version_comparison_key</key>
                            <string>CFBundleShortVersionString</string>
                        </dict>
                    </array>
                </dict>
            </dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
