<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Acrobat Pro 2017 Update</string>
	<key>Identifier</key>
	<string>com.github.jeremylarose.download.AdobeAcrobatPro2017Update</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>AdobeAcrobatPro2017Update</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
				<key>Processor</key>
				<string>URLTextSearcher</string>
				<key>Arguments</key>
				<dict>
						<key>url</key>
						<string>https://www.adobe.com/devnet-docs/acrobatetk/tools/ReleaseNotesDC/index.html</string>
						<key>re_pattern</key>
            <string>dcclassic17.(?P&lt;mid_version&gt;[0-9]+)[\D]</string>
				</dict>
		</dict>
		<dict>
				<key>Processor</key>
				<string>URLTextSearcher</string>
				<key>Arguments</key>
				<dict>
						<key>url</key>
						<string>https://www.adobe.com/devnet-docs/acrobatetk/tools/ReleaseNotesDC/index.html</string>
						<key>re_pattern</key>
            <string>17.%mid_version%.(?P&lt;minor_version&gt;[0-9]+)[\D]</string>
				</dict>
		</dict>
		<dict>
				<key>Processor</key>
				<string>URLTextSearcher</string>
				<key>Arguments</key>
				<dict>
						<key>url</key>
						<string>https://www.adobe.com/devnet-docs/acrobatetk/tools/ReleaseNotesDC/index.html</string>
						<key>re_pattern</key>
            <string>dcclassic17.%mid_version%[\S]+[\s]disablelinktracking[\D]+(?P&lt;version&gt;[\d\.]+)</string>
				</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-17.%mid_version%.%minor_version%.dmg</string>
				<key>version</key>
				<string>17.%mid_version%.%minor_version%</string>
				<key>url</key>
				<string>ftp://ftp.adobe.com/pub/adobe/acrobat/mac/Acrobat2017/17%mid_version%%minor_version%/Acrobat2017Upd17%mid_version%%minor_version%.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
		</dict>
		<dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
				<key>Arguments</key>
				<dict>
						<key>input_path</key>
						<string>%pathname%/Acrobat2017Upd17%mid_version%%minor_version%.pkg</string>
						<key>expected_authority_names</key>
						<array>
								<string>Developer ID Installer: Adobe Systems, Inc. (JQ525L2MZD)</string>
								<string>Developer ID Certification Authority</string>
								<string>Apple Root CA</string>
						</array>
				</dict>
		</dict>
	</array>
</dict>
</plist>
