<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Acrobat Pro 2017 Update</string>
	<key>Identifier</key>
	<string>com.github.jeremylarose.download.AdobeAcrobatPro2017Update</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>AdobeAcrobatPro2017Update</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
				<key>Processor</key>
				<string>URLTextSearcher</string>
				<key>Arguments</key>
				<dict>
						<key>url</key>
						<string>https://helpx.adobe.com/acrobat/release-note/release-notes-acrobat-reader.html</string>
						<key>re_pattern</key>
            <string>dcclassic17.(?P&lt;mid_version&gt;[0-9]+)[\S]+[\s]target="_blank"[\s][\S]+17.[0-9]+.(?P&lt;version&gt;[0-9]+)</string>
				</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-17.%mid_version%.%version%.dmg</string>
				<key>url</key>
				<string>ftp://ftp.adobe.com/pub/adobe/acrobat/mac/Acrobat2017/17%mid_version%%version%/Acrobat2017Upd17%mid_version%%version%.dmg</string>
				<key>curl_opts</key>
				<array>
						<string>--retry 10</string>
						<string>--retry-delay 2</string>
						<string>--retry-max-time 40</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
		</dict>
		<dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
				<key>Arguments</key>
				<dict>
						<key>input_path</key>
						<string>%pathname%/Acrobat2017Upd17%mid_version%%version%.pkg</string>
						<key>expected_authority_names</key>
						<array>
								<string>Developer ID Installer: Adobe Systems, Inc. (JQ525L2MZD)</string>
								<string>Developer ID Certification Authority</string>
								<string>Apple Root CA</string>
						</array>
				</dict>
		</dict>
	</array>
</dict>
</plist>
