<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Syncthing-macos.</string>
	<key>Identifier</key>
	<string>com.github.jeremylarose.download.Syncthing-macos</string>
	<key>Input</key>
	<dict>
		<key>GITHUB_REPO</key>
		<string>syncthing/syncthing-macos</string>
		<key>NAME</key>
		<string>Syncthing-macos</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>asset_regex</key>
				<string>Syncthing-[\S]+.dmg</string>
				<key>github_repo</key>
				<string>%GITHUB_REPO%</string>
			</dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
				<key>Arguments</key>
				<dict>
						<key>input_path</key>
						<string>%pathname%/Syncthing.app</string>
						<key>requirement</key>
						<string>anchor apple generic and identifier "com.github.xor-gate.syncthing-macosx" and (certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "LQE5SYM783")</string>
				</dict>
		</dict>
	</array>
</dict>
</plist>
