<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest E7240 BIOS Update.</string>
	<key>Identifier</key>
	<string>com.github.jeremylarose.download.Win.BIOS-E7240</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>E7240</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
				<key>Processor</key>
				<string>URLTextSearcher</string>
				<key>Arguments</key>
				<dict>
						<key>url</key>
						<string>http://www.dell.com/support/home/us/en/04/product-support/product/latitude-e7240-ultrabook/drivers</string>
						<key>re_pattern</key>
            <string>downloads.dell.com[\W](?P&lt;folder&gt;[\S]+)[\W](?P&lt;number&gt;[\S]+)[\W]%NAME%(?P&lt;version&gt;[\S]+).exe</string>
				</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://downloads.dell.com/%folder%/%number%/%NAME%%version%.exe</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
