<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Adobe Reader XI Update</string>
	<key>Identifier</key>
	<string>com.github.jeremylarose.download.AdobeReaderXIUpdate</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>AdobeReaderXIUpdate</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
				<key>Processor</key>
				<string>URLTextSearcher</string>
				<key>Arguments</key>
				<dict>
						<key>url</key>
						<string>https://helpx.adobe.com/acrobat/release-note/release-notes-acrobat-reader.html</string>
						<key>re_pattern</key>
						<string>href="http://www.adobe.com/devnet-docs/acrobatetk/tools/ReleaseNotes/11/11.(?P&lt;major_version&gt;[0-9]+).(?P&lt;minor_version&gt;[0-9]+)</string>
				</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-11.%major_version%.%minor_version%.dmg</string>
				<key>url</key>
				<string>ftp://ftp.adobe.com/pub/adobe/reader/mac/11.x/11.%major_version%.%minor_version%/misc/AdbeRdrUpd11%major_version%%minor_version%.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
		</dict>
		<dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
				<key>Arguments</key>
				<dict>
						<key>input_path</key>
						<string>%pathname%/AdbeRdrUpd11%major_version%%minor_version%.pkg</string>
						<key>expected_authority_names</key>
						<array>
								<string>Developer ID Installer: Adobe Systems, Inc. (JQ525L2MZD)</string>
								<string>Developer ID Certification Authority</string>
								<string>Apple Root CA</string>
						</array>
				</dict>
		</dict>
	</array>
</dict>
</plist>
