<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of ScanSnapManageriX500 and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.jeremylarose.pkg.ScanSnapManageriX500</string>
	<key>Input</key>
	<dict>
		<key>BUNDLE_ID</key>
		<string>jp.co.pfu.ScanSnap.P2IUNISET</string>
		<key>NAME</key>
		<string>ScanSnapManageriX500</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.jeremylarose.download.ScanSnapManageriX500</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%pathname%</string>
				<key>items_to_copy</key>
				<array>
					<dict>
						<key>destination_path</key>
						<string>%RECIPE_CACHE_DIR%</string>
						<key>source_item</key>
						<string>ScanSnap Manager.pkg</string>
					</dict>
				</array>
			</dict>
			<key>Processor</key>
			<string>InstallFromDMG</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>target</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
				<key>source</key>
				<string>%RECIPE_CACHE_DIR%/ScanSnap Manager.pkg</string>
			</dict>
			<key>Processor</key>
			<string>FileMover</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<string>%RECIPE_CACHE_DIR%/downloads</string>
			</dict>
			<key>Processor</key>
			<string>PathDeleter</string>
		</dict>
	</array>
</dict>
</plist>
