<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of DYMOConnectforDesktop Executables.</string>
	<key>Identifier</key>
	<string>com.github.jeremylarose.download.Win.DYMOConnectforDesktop</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>DYMOConnectforDesktop</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
				<key>Processor</key>
				<string>URLTextSearcher</string>
				<key>Arguments</key>
				<dict>
						<key>url</key>
						<string>http://www.dymo.com/en-US/online-support/dymo-user-guides</string>
						<key>re_pattern</key>
            <string>download.dymo.com/dymo/Software/Win/DCDSetup(?P&lt;version&gt;[\d\.]+).exe</string>
				</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>http://download.dymo.com/dymo/Software/Win/DCDSetup%version%.exe</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
