<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads and extracts the latest version of BenchmarkDoseSoftware.</string>
	<key>Identifier</key>
	<string>com.github.jeremylarose.download.Win.BenchmarkDoseSoftware</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>BenchmarkDoseSoftware</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
				<key>Processor</key>
				<string>URLTextSearcher</string>
				<key>Arguments</key>
				<dict>
						<key>url</key>
						<string>https://www.epa.gov/bmds/download-benchmark-dose-software-bmds</string>
						<key>re_pattern</key>
						<string>https://www.epa.gov/sites/production/files/(?P&lt;date&gt;[\S]+)/bmds(?P&lt;version&gt;[\d]+)_setup.msi</string>
				</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://www.epa.gov/sites/production/files/%date%/bmds%version%_setup.msi</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
