<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of SyncTrayzor-x64.</string>
	<key>Identifier</key>
	<string>com.github.jeremylarose.download.Win.SyncTrayzor-x64</string>
	<key>Input</key>
	<dict>
		<key>GITHUB_REPO</key>
		<string>canton7/SyncTrayzor</string>
		<key>NAME</key>
		<string>SyncTrayzor</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>asset_regex</key>
				<string>SyncTrayzorSetup-x64.exe</string>
				<key>github_repo</key>
				<string>%GITHUB_REPO%</string>
			</dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>SyncTrayzor-%version%-x64.exe</string>
				<key>url</key>
				<string>https://github.com/canton7/SyncTrayzor/releases/download/v%version%/SyncTrayzorSetup-x64.exe</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
