<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Acrobat Pro 2020 Update</string>
	<key>Identifier</key>
	<string>com.github.jeremylarose.download.Win.AdobeAcrobatPro2020Update</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>AdobeAcrobatPro2020Update</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
				<key>Processor</key>
				<string>URLTextSearcher</string>
				<key>Arguments</key>
				<dict>
						<key>url</key>
						<string>https://www.adobe.com/devnet-docs/acrobatetk/tools/ReleaseNotesDC/index.html</string>
						<key>re_pattern</key>
            <string>dcclassic20.(?P&lt;mid_version&gt;[0-9]+)[\D]</string>
				</dict>
		</dict>
		<dict>
				<key>Processor</key>
				<string>URLTextSearcher</string>
				<key>Arguments</key>
				<dict>
						<key>url</key>
						<string>https://www.adobe.com/devnet-docs/acrobatetk/tools/ReleaseNotesDC/index.html</string>
						<key>re_pattern</key>
            <string>20.%mid_version%.(?P&lt;minor_version&gt;[0-9]+)[\D]</string>
				</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>ftp://ftp.adobe.com/pub/adobe/acrobat/win/Acrobat2020/20%mid_version%%minor_version%/Acrobat2020Upd20%mid_version%%minor_version%.msp</string>
				<key>request_headers</key>
				<dict>
								<key>user-agent</key>
								<string>Mozilla/5.0 (Windows NT 10.0; Win64; x64)</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
