<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest SaltMinion-x86_64 package.</string>
    <key>Identifier</key>
    <string>com.github.jeremylarose.download.SaltMinion-x86_64</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>SaltMinion-x86_64</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.2</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://docs.saltproject.io/salt/install-guide/en/latest/topics/install-by-operating-system/macos.html</string>
                <key>re_pattern</key>
                <string><td><p><a class="reference external" href="https://packages.broadcom.com/artifactory/saltproject-generic/macos/(?P&lt;version&gt;[\d\.]+)/salt-(?P&lt;version&gt;[\d\.]+)-py3-x86_64.pkg"</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://packages.broadcom.com/artifactory/saltproject-generic/macos/%version%/salt-%version%-py3-x86_64.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Salt Stack, Inc. (VK797BMMY4)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>
