<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest verison of Examplify</string>
    <key>Identifier</key>
    <string>com.github.jeremylarose.download.Examplify</string>
    <key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Examplify</string>
    <key>SEARCH_URL</key>
    <string>https://releases.examsoft.com/Examplify/Examplify_LATEST_mac.dmg</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.0.0</string>
	<key>Process</key>
	<array>
    <dict>
        <key>Processor</key>
        <string>URLTextSearcher</string>
        <key>Arguments</key>
        <dict>
            <key>url</key>
            <string>%SEARCH_URL%</string>
            <key>curl_opts</key>
            <array>
              <string>-I</string>
            </array>
            <key>request_headers</key>
            <dict>
              <key>content-type</key>
              <string>application/json</string>
              <key>user-agent</key>
              <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/15.3 Safari/605.1.15</string>
            </dict>
            <key>re_pattern</key>
            <string>releases.examsoft.com/Examplify/(?P&lt;version&gt;[\d\.]+)/Examplify_</string>
        </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>URLDownloader</string>
      <key>Arguments</key>
      <dict>
         <key>url</key>
         <string>https://releases.examsoft.com/Examplify/%version%/Examplify_%version%-arm64.dmg</string>
         <key>filename</key>
         <string>%NAME%-%version%.dmg</string>
         <key>request_headers</key>
         <dict>
           <key>content-type</key>
           <string>binary/octet-stream</string>
           <key>user-agent</key>
           <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/15.3 Safari/605.1.15</string>
         </dict>
      </dict>
    </dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/Examplify-%version%.dmg/Examplify_SIGNED.pkg</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
                <key>expected_authority_names</key>
                <array>
                    <string>ExamSoft Worldwide, Inc. (5P9D4ESR3W)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
        </dict>
	</array>
</dict>
</plist>
