<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest WazuhAgent-intel64 disk pkg.</string>
    <key>Identifier</key>
    <string>com.github.jeremylarose.download.WazuhAgent-intel64</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>WazuhAgent-intel64</string>
        <key>GITHUB_REPO</key>
    		<string>wazuh/wazuh</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.2</string>
    <key>Process</key>
    <array>
      <dict>
          <key>Processor</key>
          <string>URLTextSearcher</string>
          <key>Arguments</key>
          <dict>
              <key>url</key>
              <string>https://documentation.wazuh.com/current/installation-guide/packages-list.html</string>
              <key>re_pattern</key>
              <string>wazuh-agent-(?P&lt;v1&gt;[0-9]+).(?P&lt;v2&gt;[0-9]+).(?P&lt;v3&gt;[0-9]+)-(?P&lt;v4&gt;[0-9]+).intel64.pkg</string>
          </dict>
      </dict>
      <dict>
          <key>Processor</key>
          <string>URLDownloader</string>
          <key>Arguments</key>
          <dict>
              <key>url</key>
              <string>https://packages.wazuh.com/%v1%.x/macos/wazuh-agent-%v1%.%v2%.%v3%-%v4%.intel64.pkg</string>
          </dict>
      </dict>
      <dict>
          <key>Processor</key>
          <string>EndOfCheckPhase</string>
      </dict>
  	</array>
</dict>
</plist>
