<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest MinKNOW-UI-intel disk image.</string>
    <key>Identifier</key>
    <string>com.github.jeremylarose.download.MinKNOW-UI-intel</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MinKNOW-UI-intel</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.2</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://nanoporetech.com/software/other/remote-viewer</string>
                <key>re_pattern</key>
                <string>https://cdn.oxfordnanoportal.com/software/MinKNOW/MinKNOW-UI-OSX-(?P&lt;version&gt;[\d\.]+)-intel.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%-%version%.dmg</string>
                <key>url</key>
                <string>https://cdn.oxfordnanoportal.com/software/MinKNOW/MinKNOW-UI-OSX-%version%-intel.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
    		    <key>Processor</key>
    		    <string>CodeSignatureVerifier</string>
    		    <key>Arguments</key>
    		    <dict>
    		        <key>input_path</key>
    		        <string>%pathname%/MinKNOW UI.app</string>
    		        <key>requirement</key>
    		        <string>identifier "com.nanoporetech.kingfisher" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = LJKTDEZN58</string>
    		    </dict>
    		</dict>
    </array>
</dict>
</plist>
