<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release of DuplicatiClient
        and builds a package installing it to /usr/local/bin.</string>
    <key>Identifier</key>
    <string>com.github.jeremylarose.pkg.DuplicatiClient</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>DuplicatiClient</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.3.0</string>
    <key>ParentRecipe</key>
    <string>com.github.jeremylarose.download.DuplicatiClient</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/pkgroot</string>
                <key>pkgdirs</key>
                <dict>
                    <key>usr</key>
                    <string>0755</string>
                    <key>usr/local</key>
                    <string>0775</string>
                    <key>usr/local/bin</key>
                    <string>0775</string>
                </dict>
            </dict>
        </dict>
				<dict>
					<key>Arguments</key>
					<dict>
						<key>source_path</key>
						<string>%RECIPE_CACHE_DIR%/duplicati_client_%version%_macos/duplicati_client</string>
						<key>destination_path</key>
						<string>%pkgroot%/usr/local/bin</string>
					</dict>
					<key>Processor</key>
					<string>Copier</string>
				</dict>
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgname</key>
                <string>%NAME%-%version%</string>
                <key>pkg_request</key>
                <dict>
                    <key>pkgdir</key>
                    <string>%RECIPE_CACHE_DIR%</string>
                    <key>id</key>
                    <string>com.pectojin.duplicati-client</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>usr</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>admin</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
    </array>
</dict>
</plist>
