<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads EndNoteX9 and the latest update.</string>
	<key>Identifier</key>
	<string>com.github.jeremylarose.download.Win.EndNoteX9</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>EndNoteX9</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>http://download.endnote.com/downloads/X9/ENX9Inst.msi</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
				<key>Processor</key>
				<string>URLTextSearcher</string>
				<key>Arguments</key>
				<dict>
						<key>url</key>
						<string>http://endnote.com/downloads/available-updates</string>
						<key>re_pattern</key>
						<string>EndNote X9.(?P&lt;version&gt;[\d\.]+) for Windows</string>
				</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
        <string>http://download.endnote.com/updates/19.0/ENX9%version%Update.msp</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
