<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Skype Executables. Requires https://bitbucket.org/haypo/hachoir/wiki/hachoir-metadata.</string>
	<key>Identifier</key>
	<string>com.github.jeremylarose.download.Win.Skype</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Skype</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://www.skype.com/go/getskype-full</string>
				<key>filename</key>
				<string>%NAME%-full.exe</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
				<key>Processor</key>
				<string>com.github.hansen-m.SharedProcessors/HachoirMetaDataProvider</string>
				<key>Arguments</key>
				<dict>
						<key>file_path</key>
						<string>%pathname%</string>
				</dict>
		</dict>
		<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
