<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Horos disk image.</string>
    <key>Identifier</key>
    <string>com.github.jeremylarose.download.Horos</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Horos</string>
        <key>GITHUB_REPO</key>
    		<string>horosproject/horos</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.2</string>
    <key>Process</key>
    <array>
       <dict>
  			 <key>Arguments</key>
  		 	 <dict>
  			 	 <key>github_repo</key>
  		 		 <string>%GITHUB_REPO%</string>
           <key>asset_regex</key>
   				<string>https://github.com/horosproject/horos/archive/[\S]+.zip</string>
  			 </dict>
  			 <key>Processor</key>
  			 <string>GitHubReleasesInfoProvider</string>
       </dict>
       <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%-%version%.dmg</string>
                <key>url</key>
                <string>https://horosproject.org/horos-content/Horos%version%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
    		    <key>Processor</key>
    		    <string>CodeSignatureVerifier</string>
    		    <key>Arguments</key>
    		    <dict>
    		        <key>input_path</key>
    		        <string>%pathname%/Horos.app</string>
    		        <key>requirement</key>
    		        <string>anchor apple generic and identifier "org.horosproject.horos" and (certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "WGC24S6NKV")</string>
    		    </dict>
    		</dict>
    </array>
</dict>
</plist>
