<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Horos disk image.</string>
    <key>Identifier</key>
    <string>com.github.jeremylarose.download.Horos</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Horos</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.2</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.horosproject.org/adaa7f5d1f33cb8ddd89fe300da7c2cd/</string>
                <key>re_pattern</key>
                <string>Horos(?P&lt;version&gt;[\d\.]+).dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%-%version%.dmg</string>
                <key>url</key>
                <string>http://www.horosproject.org/wp-content/uploads/downloads/Horos%version%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
    		    <key>Processor</key>
    		    <string>CodeSignatureVerifier</string>
    		    <key>Arguments</key>
    		    <dict>
    		        <key>input_path</key>
    		        <string>%pathname%/Horos.app</string>
    		        <key>requirement</key>
    		        <string>anchor apple generic and identifier "com.horosproject.horos" and (certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "WGC24S6NKV")</string>
    		    </dict>
    		</dict>
    </array>
</dict>
</plist>
