<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Horos disk image.</string>
    <key>Identifier</key>
    <string>com.github.jeremylarose.download.Horos</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Horos</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.2</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.horosproject.org/adaa7f5d1f33cb8ddd89fe300da7c2cd/</string>
                <key>re_pattern</key>
                <string>Horos(?P&lt;version&gt;[\d\.]+).dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%-%version%.dmg</string>
                <key>url</key>
                <string>http://www.horosproject.org/wp-content/uploads/downloads/Horos%version%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
    				<key>Processor</key>
    				<string>CodeSignatureVerifier</string>
    				<key>Arguments</key>
    				<dict>
    						<key>input_path</key>
    						<string>%pathname%/Horos.app</string>
    						<key>expected_authority_names</key>
    						<array>
    								<string>Developer ID Application: Fauze Polpeta (WGC24S6NKV)</string>
    								<string>Developer ID Certification Authority</string>
    								<string>Apple Root CA</string>
    						</array>
    				</dict>
    		</dict>
    </array>
</dict>
</plist>
