<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Horos disk image.</string>
    <key>Identifier</key>
    <string>com.github.autopkg.download.Horos</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Horos</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.horosproject.org/adaa7f5d1f33cb8ddd89fe300da7c2cd/</string>
                <key>re_pattern</key>
                <string>href="http://www.horosproject.org/wp-content/uploads/downloads/Horos(?P&lt;version&gt;[\d\.]+).dmg"</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%%version%.dmg</string>
                <key>url</key>
                <string>http://www.horosproject.org/wp-content/uploads/downloads/%NAME%%version%.dmg<</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
