<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads and installs the latest version of Office 2019 Suite for Mac.</string>
    <key>Identifier</key>
    <string>com.github.jeremylarose.install.MSOffice2019</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MSOffice2019</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.jeremylarose.download.MSOffice2019</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Installer</string>
        </dict>
    </array>
</dict>
</plist>
