<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Duplicati.</string>
	<key>Identifier</key>
	<string>com.github.jeremylarose.download.Duplicati</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Duplicati</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
				<key>Processor</key>
				<string>URLTextSearcher</string>
				<key>Arguments</key>
				<dict>
						<key>url</key>
						<string>https://github.com/duplicati/duplicati/releases</string>
						<key>re_pattern</key>
						<string>duplicati-(?P&lt;version&gt;[\d\.]+)_(?P&lt;branch&gt;[\w]+)_(?P&lt;date&gt;[\d\-]+).dmg</string>
				</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%.dmg</string>
				<key>url</key>
				<string>https://github.com/duplicati/duplicati/releases/download/v%version%-%version%_%branch%_%date%/duplicati-%version%_%branch%_%date%.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
