<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Duplicati disk image.</string>
    <key>Identifier</key>
    <string>com.github.jeremylarose.download.Duplicati</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Duplicati</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.2</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://github.com/duplicati/duplicati/releases</string>
                <key>re_pattern</key>
                <string>href="/duplicati/duplicati/releases/download/v(?P&lt;full_version&gt;[\d\.]+)-%full_version%_experimental_(?P&lt;date&gt;[\d\.]+)/duplicati-%full_version%_experimental_%date%.dmg"</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%-%full_version%.dmg</string>
                <key>url</key>
                <string>https://github.com/duplicati/duplicati/releases/download/v%full_version%-%full_version%_experimental_%date%/duplicati-%full_version%_experimental_%date%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
