<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of 7zip-x64 Executables.</string>
	<key>Identifier</key>
	<string>com.github.jeremylarose.pkg.Win.7zip-x64</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>7zip</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.hansen-m.download.7zip-Win64</string>
	<key>Process</key>
	<array>
		<dict>
		  <key>Processor</key>
		  <string>com.github.jeremylarose.SharedProcessors/PkgCreator7z</string>
			<key>Arguments</key>
			<dict>
				<key>install_flags</key>
				<string>/qn</string>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.msi</string>
			</dict>
    </dict>
	</array>
</dict>
</plist>
