<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of AdobeAcrobatProXIUpdate Executables.</string>
	<key>Identifier</key>
	<string>com.github.jeremylarose.pkg.Win.AdobeAcrobatProXIUpdate</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>AdobeAcrobatProXIUpdate</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.jeremylarose.download.Win.AdobeAcrobatProXIUpdate</string>
	<key>Process</key>
	<array>
		<dict>
				<key>Processor</key>
				<string>FileCreator</string>
				<key>Arguments</key>
				<dict>
						<key>file_path</key>
						<string>%RECIPE_CACHE_DIR%/install.bat</string>
						<key>file_content</key>
						<string>@echo off

cls
echo --------------------------------------------------------
echo .
echo .
echo .       Installing Adobe Acrobat XI Update- Please Wait
echo .          Window will close once installed
echo .
echo .
echo --------------------------------------------------------

msiexec /p %~dp0extrafiles\AdobeAcrobatProXIUpdate-11.0.21.msp /qn /norestart
						</string>
				</dict>
		</dict>
		<dict>
		  <key>Processor</key>
		  <string>com.github.jeremylarose.SharedProcessors/PkgCreator7z</string>
			<key>Arguments</key>
			<dict>
				<key>install_flags</key>
				<string>/qn /norestart</string>
				<key>input_bat_path</key>
				<string>%RECIPE_CACHE_DIR%/install.bat</string>
				<key>extra_files</key>
				<string>%RECIPE_CACHE_DIR%/downloads/extrafiles</string>
			</dict>
    </dict>
	</array>
</dict>
</plist>
