<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of GraphPad Prism and imports it into Munki.

Set the DERIVE_MIN_OS variable to a non-empty string to set the minimum_os_version via MunkiInstallsItemsCreator. This requires a minimum AutoPkg version of 2.7 please update if you're not already running it.</string>
    <key>Identifier</key>
    <string>com.github.jeremylarose.munki.Prism10</string>
    <key>Input</key>
    <dict>
        <key>MAJOR_VERSION</key>
        <string>10</string>
        <key>APP_FILENAME</key>
        <string>Prism %MAJOR_VERSION%</string>
        <key>DERIVE_MIN_OS</key>
        <string>YES</string>
        <key>CATEGORY</key>
        <string>Scientific Software</string>
        <key>NAME</key>
        <string>Prism%MAJOR_VERSION%</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>%CATEGORY%</string>
            <key>description</key>
            <string>Scientific graphing and nonlinear curve regression tool.</string>
            <key>developer</key>
            <string>GraphPad</string>
            <key>display_name</key>
            <string>Prism %MAJOR_VERSION%</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <false/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>2.7</string>
    <key>ParentRecipe</key>
    <string>com.github.rtrouton.download.Prism</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
              <key>pkg_path</key>
              <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
