<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of SyncTrayzor x86 and x64 and creates an OS dependent silent installer.</string>
	<key>Identifier</key>
	<string>com.github.jeremylarose.pkg.Win.SyncTrayzor</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>SyncTrayzor</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.jeremylarose.download.Win.SyncTrayzor</string>
	<key>Process</key>
	<array>
		<dict>
				<key>Processor</key>
				<string>FileCreator</string>
				<key>Arguments</key>
				<dict>
						<key>file_path</key>
						<string>%RECIPE_CACHE_DIR%/nop.exe</string>
						<key>file_content</key>
						<string>nothing to see here</string>
				</dict>
		</dict>
		<dict>
				<key>Processor</key>
				<string>FileCreator</string>
				<key>Arguments</key>
				<dict>
						<key>file_path</key>
						<string>%RECIPE_CACHE_DIR%/install.bat</string>
						<key>file_content</key>
						<string>@echo off


cls
echo --------------------------------------------------------
echo .
echo .
echo .             Installing SyncTrayzor - Please Wait
echo .              Window will close once installed
echo .
echo .
echo --------------------------------------------------------

:: Kill running tasks
tasklist.exe /FI "IMAGENAME eq SyncTrayzor.exe" 2>NUL | find /I /N "SyncTrayzor.exe" && Taskkill /IM SyncTrayzor.exe /F
tasklist.exe /FI "IMAGENAME eq syncthing.exe" 2>NUL | find /I /N "syncthing.exe" && Taskkill /IM syncthing.exe /F

::Install 64-bit for 64-Bit systems and 32-Bit for 32-Bit Systems
IF EXIST "C:\Program Files (x86)" %~dp0downloads\SyncTrayzor-%version%-x64.exe /VERYSILENT
IF NOT EXIST "C:\Program Files (x86)" %~dp0downloads\SyncTrayzor-%version%-x86.exe /VERYSILENT

:: reopen for current user
schtasks /Create /tn startsynctrayzor /ru "Users" /sc ONEVENT /MO "*[System[Provider[@Name='Search'] and EventID=444]]" /ec Application /tr "C:\Program Files\SyncTrayzor\SyncTrayzor.exe --minimized" /f
eventcreate /T Information /ID 444 /L Application /SO Search /D "synctrayzor started"
schtasks /delete /tn startsynctrayzor /f
EXIT

						</string>
				</dict>
		</dict>
		<dict>
		  <key>Processor</key>
		  <string>com.github.jeremylarose.SharedProcessors/PkgCreator7z</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_name</key>
				<string>SyncTrayzor-%version%.exe</string>
				<key>install_flags</key>
				<string>REM</string>
				<key>input_bat_path</key>
				<string>%RECIPE_CACHE_DIR%/install.bat</string>
				<key>extra_files</key>
				<string>%RECIPE_CACHE_DIR%/downloads</string>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/nop.exe</string>
			</dict>
    </dict>
		<dict>
				<key>Processor</key>
				<string>PathDeleter</string>
				<key>Arguments</key>
				<dict>
						<key>path_list</key>
						<array>
								<string>%RECIPE_CACHE_DIR%/install.bat</string>
						</array>
				</dict>
		</dict>
		<dict>
				<key>Processor</key>
				<string>PathDeleter</string>
				<key>Arguments</key>
				<dict>
						<key>path_list</key>
						<array>
								<string>%RECIPE_CACHE_DIR%/nop.exe</string>
						</array>
				</dict>
		</dict>
	</array>
</dict>
</plist>
