<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of VLC x86 and x64 and creates an OS dependent silent installer.</string>
	<key>Identifier</key>
	<string>com.github.jeremylarose.pkg.Win.VLC</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>VLC</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.jeremylarose.download.Win.VLC</string>
	<key>Process</key>
	<array>
		<dict>
				<key>Processor</key>
				<string>FileCreator</string>
				<key>Arguments</key>
				<dict>
						<key>file_path</key>
						<string>%RECIPE_CACHE_DIR%/install.bat</string>
						<key>file_content</key>
						<string>@echo off

::check if current version is installed, if is, exit, else continue....
reg.exe query "HKEY_LOCAL_MACHINE\SOFTWARE\Microsoft\Windows\CurrentVersion\Uninstall\VLC media player" /v DisplayVersion | findstr %version% || goto notinstalled
EXIT
:notinstalled

:: quit installer if application is running, else continue....
tasklist.exe /FI "IMAGENAME eq vlc.exe" 2>NUL | find /I /N "vlc.exe" || goto notrunning
EXIT
:notrunning

cls
echo --------------------------------------------------------
echo .
echo .
echo .             Installing VLC - Please Wait
echo .           Window will close once installed
echo .
echo .
echo --------------------------------------------------------

:: Uninstall existing x86 version if installed
if exist "C:\Program Files (x86)\VideoLAN\VLC\uninstall.exe" "C:\Program Files (x86)\VideoLAN\VLC\uninstall.exe" /S

::Install 64-bit for 64-Bit systems and 32-Bit for 32-Bit Systems
IF NOT EXIST "C:\Program Files (x86)" GOTO x86install
pushd "%~dp0"
IF EXIST "C:\Program Files (x86)" vlc-%version%-win64.exe /language=en_GB /S
popd
EXIT

:x86install
						</string>
				</dict>
		</dict>
		<dict>
		  <key>Processor</key>
		  <string>com.github.jeremylarose.SharedProcessors/PkgCreator7z</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_name</key>
				<string>%NAME%-%version%.exe</string>
				<key>install_flags</key>
				<string>/language=en_GB /S</string>
				<key>input_bat_path</key>
				<string>%RECIPE_CACHE_DIR%/install.bat</string>
				<key>extra_files</key>
				<string>%RECIPE_CACHE_DIR%/downloads/vlc-%version%-win64.exe</string>
			</dict>
    </dict>
		<dict>
				<key>Processor</key>
				<string>PathDeleter</string>
				<key>Arguments</key>
				<dict>
						<key>path_list</key>
						<array>
								<string>%RECIPE_CACHE_DIR%/install.bat</string>
						</array>
				</dict>
		</dict>
	</array>
</dict>
</plist>
