<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of GetFoldersize Executables.</string>
	<key>Identifier</key>
	<string>com.github.jeremylarose.download.Win.GetFoldersize</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>GetFoldersize</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
				<key>Processor</key>
				<string>URLTextSearcher</string>
				<key>Arguments</key>
				<dict>
						<key>url</key>
						<string>http://www.getfoldersize.com/en_download_getfoldersize.php</string>
						<key>re_pattern</key>
            <string>href="/getfoldersize/en_getfoldersize_version.php">(?P&lt;version&gt;[\d\.]+)</string>
				</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%.exe</string>
				<key>url</key>
				<string>http://www.getfoldersize.de/download/GetFoldersizeSetup.exe</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
