<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads and creates a ScanSnapManageriX500 silent installer.</string>
	<key>Identifier</key>
	<string>com.github.jeremylarose.pkg.Win.ScanSnapManageriX500</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>ScanSnapManageriX500</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.jeremylarose.download.Win.ScanSnapManageriX500</string>
	<key>Process</key>
	<array>
		<dict>
				<key>Processor</key>
				<string>FileCreator</string>
				<key>Arguments</key>
				<dict>
						<key>file_path</key>
						<string>%RECIPE_CACHE_DIR%/working/setup.iss</string>
						<key>file_content</key>
						<string>[InstallShield Silent]
Version=v7.00
File=Response File
[File Transfer]
OverwrittenReadOnly=NoToAll
[{DBCDB997-EEEB-4BE9-BAFF-26B4094DBDE6}-DlgOrder]
Dlg0={DBCDB997-EEEB-4BE9-BAFF-26B4094DBDE6}-SdWelcome-0
Count=5
Dlg1={DBCDB997-EEEB-4BE9-BAFF-26B4094DBDE6}-SdLicense2Rtf-0
Dlg2={DBCDB997-EEEB-4BE9-BAFF-26B4094DBDE6}-SdAskDestPath-0
Dlg3={DBCDB997-EEEB-4BE9-BAFF-26B4094DBDE6}-SdStartCopy-0
Dlg4={DBCDB997-EEEB-4BE9-BAFF-26B4094DBDE6}-SdFinish-0
[{DBCDB997-EEEB-4BE9-BAFF-26B4094DBDE6}-SdWelcome-0]
Result=1
[{DBCDB997-EEEB-4BE9-BAFF-26B4094DBDE6}-SdLicense2Rtf-0]
Result=1
[{DBCDB997-EEEB-4BE9-BAFF-26B4094DBDE6}-SdAskDestPath-0]
szDir=C:\Program Files (x86)\PFU\ScanSnap
Result=1
[{DBCDB997-EEEB-4BE9-BAFF-26B4094DBDE6}-SdStartCopy-0]
Result=1
[Application]
Name=ScanSnap Manager
Version=V%major%%minor%L%latest%
Company=PFU
Lang=0009
[{DBCDB997-EEEB-4BE9-BAFF-26B4094DBDE6}-SdFinish-0]
Result=1
bOpt1=0
bOpt2=0
[{C73431A9-4BBE-4CE9-97E6-5E27EEBFB183}-DlgOrder]
Count=0
						</string>
				</dict>
		</dict>
		<dict>
				<key>Processor</key>
				<string>FileCreator</string>
				<key>Arguments</key>
				<dict>
						<key>file_path</key>
						<string>%RECIPE_CACHE_DIR%/working/install.bat</string>
						<key>file_content</key>
						<string>@echo off

cls
echo --------------------------------------------------------
echo .
echo .
echo .      Installing ScanSnap Manager iX500 - Please Wait
echo .           Window will close once installed
echo .
echo .
echo --------------------------------------------------------

xcopy %~dp0setup.iss c:\windows\temp /y
						</string>
				</dict>
		</dict>
		<dict>
		  <key>Processor</key>
		  <string>com.github.jeremylarose.SharedProcessors/PkgCreator7z</string>
			<key>Arguments</key>
			<dict>
				<key>install_flags</key>
				<string>/s /f1c:\windows\temp\setup.iss</string>
				<key>input_bat_path</key>
				<string>%RECIPE_CACHE_DIR%/working/install.bat</string>
				<key>extra_files</key>
				<string>%RECIPE_CACHE_DIR%/working/setup.iss</string>
				<key>pkg_name</key>
				<string>%NAME%-V%major%%minor%L%latest%.exe</string>
			</dict>
    </dict>
		<dict>
				<key>Processor</key>
				<string>PathDeleter</string>
				<key>Arguments</key>
				<dict>
						<key>path_list</key>
						<array>
								<string>%RECIPE_CACHE_DIR%/working</string>
						</array>
				</dict>
		</dict>
	</array>
</dict>
</plist>
