<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest ScanSnapManageriX500 installer.</string>
    <key>Identifier</key>
    <string>com.github.jeremylarose.download.Win.ScanSnapManageriX500</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>ScanSnapManageriX500</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.2</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://www.fujitsu.com/global/support/products/computing/peripheral/scanners/scansnap/software/ix500w-setup.html</string>
                <key>re_pattern</key>
                <string>WiniX500ManagerV(?P&lt;major&gt;[0-9])(?P&lt;minor&gt;[0-9])L(?P&lt;latest&gt;[0-9]+)WW.exe</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
								<key>url</key>
                <string>http://origin.pfultd.com/downloads/IMAGE/driver/ss/mgr/w-ix500/WiniX500ManagerV%major%%minor%L%latest%WW.exe</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
