<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest offline versions of Firefox x86 and x64 and creates an OS dependent silent installer.</string>
	<key>Identifier</key>
	<string>com.github.jeremylarose.pkg.Win.Firefox</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Firefox</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.jeremylarose.download.Win.Firefox</string>
	<key>Process</key>
	<array>
		<dict>
				<key>Processor</key>
				<string>FileCreator</string>
				<key>Arguments</key>
				<dict>
						<key>file_path</key>
						<string>%RECIPE_CACHE_DIR%/install.bat</string>
						<key>file_content</key>
						<string>@echo off

:: quit installer if application is running, else continue....
tasklist.exe /FI "IMAGENAME eq firefox.exe" 2>NUL | find /I /N "firefox.exe" || goto notrunning
EXIT
:notrunning

cls
echo --------------------------------------------------------
echo .
echo .
echo .          Installing Firefox - Please Wait
echo .          Window will close once installed
echo .
echo .
echo --------------------------------------------------------

::uninstall older versions of 3 or 4 if installed
IF EXIST "c:\program files\Mozilla Firefox\uninstall\helper.exe" "c:\program files\Mozilla Firefox\uninstall\helper.exe" -ms
IF EXIST "c:\program files(x86)\Mozilla Firefox\uninstall\helper.exe" "c:\program files(x86)\Mozilla Firefox\uninstall\helper.exe" -ms
IF EXIST "c:\program files%\Mozilla Firefox\uninstall\helper.exe" "c:\program files\Mozilla Firefox\uninstall\helper.exe" /s
IF EXIST "c:\program files(x86)\Mozilla Firefox\uninstall\helper.exe" "c:\program files(x86)\Mozilla Firefox\uninstall\helper.exe" /s

::Install new version
IF NOT EXIST "C:\Program Files (x86)" GOTO x86install
pushd "%~dp0"
IF EXIST "C:\Program Files (x86)" %NAME%-%version%-x64.exe -ms
popd
EXIT

:x86install
						</string>
				</dict>
		</dict>
		<dict>
		  <key>Processor</key>
		  <string>com.github.jeremylarose.SharedProcessors/PkgCreator7z</string>
			<key>Arguments</key>
			<dict>
				<key>install_flags</key>
				<string>-ms</string>
				<key>input_bat_path</key>
				<string>%RECIPE_CACHE_DIR%/install.bat</string>
				<key>extra_files</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%-%version%-x64.exe</string>
				<key>pkg_name</key>
				<string>%NAME%-%version%.exe</string>
			</dict>
    </dict>
		<dict>
				<key>Processor</key>
				<string>PathDeleter</string>
				<key>Arguments</key>
				<dict>
						<key>path_list</key>
						<array>
								<string>%RECIPE_CACHE_DIR%/install.bat</string>
						</array>
				</dict>
		</dict>
	</array>
</dict>
</plist>
