<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Paint.NET and creates a silent installer.</string>
	<key>Identifier</key>
	<string>com.github.jeremylarose.pkg.Win.Paint.NET</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Paint.NET</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.jeremylarose.download.Win.Paint.NET</string>
	<key>Process</key>
	<array>
		<dict>
		  <key>Processor</key>
		  <string>com.github.jeremylarose.SharedProcessors/PkgCreator7z</string>
			<key>Arguments</key>
			<dict>
				<key>install_flags</key>
				<string>/auto DESKTOPSHORTCUT=0 CHECKFORUPDATES=0 JPGPNGBMPEDITOR=0</string>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/%filename%</string>
				<key>pkg_name</key>
				<string>%NAME%-%version%.exe</string>
			</dict>
    </dict>
	</array>
</dict>
</plist>
