<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Zoom and creates a silent installer.</string>
	<key>Identifier</key>
	<string>com.github.jeremylarose.pkg.Win.Zoom</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Zoom</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.jeremylarose.download.Win.Zoom</string>
	<key>Process</key>
	<array>
		<dict>
				<key>Processor</key>
				<string>FileCreator</string>
				<key>Arguments</key>
				<dict>
						<key>file_path</key>
						<string>%RECIPE_CACHE_DIR%/downloads/nop.exe</string>
						<key>file_content</key>
						<string>nothing to see here</string>
				</dict>
		</dict>
		<dict>
				<key>Processor</key>
				<string>FileCreator</string>
				<key>Arguments</key>
				<dict>
						<key>file_path</key>
						<string>%RECIPE_CACHE_DIR%/downloads/install.bat</string>
						<key>file_content</key>
						<string>@echo off

cls
echo --------------------------------------------------------
echo .
echo .
echo .            Installing Zoom - Please Wait
echo .           Window will close once installed
echo .
echo .
echo --------------------------------------------------------

msiexec /i %~dp0%NAME%-%version_major%.%version_minor%.msi /quiet /qn /norestart ZNoDesktopShortCut="true"
EXIT
						</string>
				</dict>
		</dict>
		<dict>
		  <key>Processor</key>
		  <string>com.github.jeremylarose.SharedProcessors/PkgCreator7z</string>
			<key>Arguments</key>
			<dict>
				<key>install_flags</key>
				<string>REM</string>
				<key>input_bat_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/install.bat</string>
				<key>extra_files</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%-%version%.msi</string>
				<key>pkg_name</key>
				<string>%NAME%-%version%.exe</string>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/nop.exe</string>
			</dict>
    </dict>
		<dict>
				<key>Processor</key>
				<string>PathDeleter</string>
				<key>Arguments</key>
				<dict>
						<key>path_list</key>
						<array>
								<string>%RECIPE_CACHE_DIR%/downloads/install.bat</string>
						</array>
				</dict>
		</dict>
		<dict>
				<key>Processor</key>
				<string>PathDeleter</string>
				<key>Arguments</key>
				<dict>
						<key>path_list</key>
						<array>
								<string>%RECIPE_CACHE_DIR%/downloads/nop.exe</string>
						</array>
				</dict>
		</dict>
	</array>
</dict>
</plist>
