<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Zoom Executables.</string>
	<key>Identifier</key>
	<string>com.github.jeremylarose.download.Win.Zoom</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Zoom</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
				<key>Processor</key>
				<string>URLTextSearcher</string>
				<key>Arguments</key>
				<dict>
						<key>url</key>
						<string>https://zoom.us/download</string>
						<key>request_headers</key>
						<dict>
										<key>user-agent</key>
										<string>Mozilla/5.0 (Windows NT 10.0; Win64; x64)</string>
						</dict>
						<key>re_pattern</key>
            <string>Version" "(?P&lt;version&gt;[\d\.]+)" "</string>
				</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%.msi</string>
				<key>url</key>
				<string>https://www.zoom.us/client/latest/ZoomInstallerFull.msi</string>
				<key>request_headers</key>
				<dict>
								<key>user-agent</key>
								<string>Mozilla/5.0 (Windows NT 10.0; Win64; x64)</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
