<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of PulseSecureVirginiaTech and creates a silent installer.</string>
	<key>Identifier</key>
	<string>com.github.jeremylarose.pkg.Win.PulseSecureVirginiaTech</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>PulseSecureVirginiaTech</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.jeremylarose.download.Win.PulseSecureVirginiaTech</string>
	<key>Process</key>
	<array>
		<dict>
		  <key>Processor</key>
		  <string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>http://www.caltech.edu/master-calendar/day</string>
				<key>re_pattern</key>
				<string>og:title"[\s]content="(?P&lt;date&gt;[\d\-]+)</string>
			</dict>
		</dict>	
		<dict>
		  <key>Processor</key>
		  <string>com.github.jeremylarose.SharedProcessors/PkgCreator7z</string>
			<key>Arguments</key>
			<dict>
				<key>install_flags</key>
				<string>/s</string>
				<key>pkg_name</key>
				<string>%NAME%-%date%.exe</string>
			</dict>
                </dict>
	</array>
</dict>
</plist>
