<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download and add Microsoft Office Suite to Munki</string>
    <key>Identifier</key>
    <string>com.github.jeremylarose.munki.MSOfficeSuite</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MSOfficeSuite</string>
        <key>PRODUCTID</key>
        <string>525133</string>
        <key>DOWNLOADURL</key>
        <string>https://go.microsoft.com/fwlink/?linkid=%PRODUCTID%</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>MINIMUM_OS_VERSION</key>
        <string>12.0</string>
        <key>pkginfo</key>
        <dict>
            <key>blocking_applications</key>
            <array>
                <string>Microsoft Error Reporting</string>
                <string>Microsoft Word</string>
                <string>Microsoft Excel</string>
                <string>Microsoft PowerPoint</string>
                <string>Microsoft Outlook</string>
                <string>Microsoft OneNote</string>
            </array>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Microsoft Productivity Suite Including Word, Excel, PowerPoint, Outlook, and OneNote</string>
            <key>category</key>
      			<string>Productivity</string>
      			<key>developer</key>
      			<string>Microsoft</string>
            <key>display_name</key>
            <string>Microsoft Office Suite</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>unattended_uninstall</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.jeremylarose.pkg.MSOfficeSuite</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>minimum_os_version</key>
                    <string>%MINIMUM_OS_VERSION%</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pkg_path%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
