<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads and extracts the latest version of WazuhAgent.</string>
	<key>Identifier</key>
	<string>com.github.jeremylarose.download.Win.WazuhAgent</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>WazuhAgent</string>
		<key>GITHUB_REPO</key>
		<string>wazuh/wazuh</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
				<key>Processor</key>
				<string>URLTextSearcher</string>
				<key>Arguments</key>
				<dict>
						<key>url</key>
						<string>https://documentation.wazuh.com/4.0/installation-guide/packages-list.html</string>
						<key>re_pattern</key>
						<string>wazuh-agent-(?P&lt;v1&gt;[0-9]+).(?P&lt;v2&gt;[0-9]+).(?P&lt;v3&gt;[0-9]+)-(?P&lt;v4&gt;[0-9]+).msi</string>
				</dict>
		</dict>
		<dict>
				<key>Processor</key>
				<string>URLDownloader</string>
				<key>Arguments</key>
				<dict>
						<key>url</key>
						<string>https://packages.wazuh.com/%v1%.x/windows/wazuh-agent-%v1%.%v2%.%v3%-%v4%.msi</string>
				</dict>
		</dict>
		<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
