<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads and extracts the latest version of OCSInventoryNGAgent.</string>
	<key>Identifier</key>
	<string>com.github.jeremylarose.download.Win.OCSInventoryNGAgent</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>OCSInventoryNGAgent</string>
		<key>GITHUB_REPO</key>
		<string>OCSInventory-NG/WindowsAgent</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>asset_regex</key>
				<string>OCSNG-Windows-Agent-(?P&lt;version&gt;[\d\.]+).zip</string>
				<key>github_repo</key>
				<string>%GITHUB_REPO%</string>
			</dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads</string>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
		  <key>Processor</key>
		  <string>FileMover</string>
			<key>Arguments</key>
			<dict>
				<key>source</key>
				<string>%RECIPE_CACHE_DIR%/downloads/OCSNG-Windows-Agent-%version%/OCS-NG-Windows-Agent-Setup.exe</string>
				<key>target</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%-%version%.exe</string>
			</dict>
    </dict>
		<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
