<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of TreeSizeFree and creates a silent installer.</string>
	<key>Identifier</key>
	<string>com.github.jeremylarose.pkg.Win.TreeSizeFree</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>TreeSizeFree</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.jeremylarose.download.Win.TreeSizeFree</string>
	<key>Process</key>
	<array>
		<dict>
				<key>Processor</key>
				<string>FileCreator</string>
				<key>Arguments</key>
				<dict>
						<key>file_path</key>
						<string>%RECIPE_CACHE_DIR%/install.bat</string>
						<key>file_content</key>
						<string>@echo off

::check if current version is installed, if is, exit, else continue....
reg.exe query "HKEY_LOCAL_MACHINE\SOFTWARE\Wow6432Node\Microsoft\Windows\CurrentVersion\Uninstall\TreeSize Free_is1" /v DisplayVersion | findstr %version% || goto notinstalled
EXIT
:notinstalled

cls
echo --------------------------------------------------------
echo .
echo .
echo .           Installing TreeSizeFree - Please Wait
echo .              Window will close once installed
echo .
echo .
echo --------------------------------------------------------
						</string>
				</dict>
		</dict>
		<dict>
		  <key>Processor</key>
		  <string>com.github.jeremylarose.SharedProcessors/PkgCreator7z</string>
			<key>Arguments</key>
			<dict>
				<key>install_flags</key>
				<string>/VERYSILENT /NORESTART /NOICONS</string>
				<key>input_bat_path</key>
				<string>%RECIPE_CACHE_DIR%/install.bat</string>
			</dict>
    </dict>
		<dict>
				<key>Processor</key>
				<string>PathDeleter</string>
				<key>Arguments</key>
				<dict>
						<key>path_list</key>
						<array>
								<string>%RECIPE_CACHE_DIR%/install.bat</string>
						</array>
				</dict>
		</dict>
	</array>
</dict>
</plist>
