<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest 3030AIO drivers cab.</string>
	<key>Identifier</key>
	<string>com.github.jeremylarose.download.Win.DriverPack-3030AIO-win10</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>3030AIO</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
				<key>Processor</key>
				<string>URLTextSearcher</string>
				<key>Arguments</key>
				<dict>
						<key>url</key>
						<string>http://en.community.dell.com/techcenter/enterprise-client/w/wiki/11528.optiplex-3030-aio-windows-10-driver-pack</string>
						<key>re_pattern</key>
            <string>http://downloads.dell.com/(?P&lt;urlstring&gt;[\S]+)-(?P&lt;platform&gt;[\S]+)-(?P&lt;version&gt;[\S]+)-(?P&lt;id&gt;[\S]+).CAB</string>
				</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>http://downloads.dell.com/%urlstring%-%platform%-%version%-%id%.CAB</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
 				<key>Processor</key>
 				<string>EndOfCheckPhase</string>
 		</dict>
	</array>
</dict>
</plist>
