<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest vpop disk image.</string>
    <key>Identifier</key>
    <string>com.github.jeremylarose.download.vpop</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>vpop</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.2</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://vpop-pro.com/#download</string>
                <key>re_pattern</key>
                <string>/app-updates/vpop-(?P&lt;version&gt;[\d\.]+).dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://vpop-pro.com/#download</string>
                <key>re_pattern</key>
                <string>"https://vpop-([A-Za-z0-9]+(\.[A-Za-z0-9]+)+)/app-updates/vpop-%version%.dmg"</string>
                <key>result_output_var_name</key>
                <string>vpop_download_link</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%-%version%.dmg</string>
                <key>url</key>
                <string>https://vpop-%vpop_download_link%/app-updates/vpop-%version%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
    		    <key>Processor</key>
    		    <string>CodeSignatureVerifier</string>
    		    <key>Arguments</key>
    		    <dict>
    		        <key>input_path</key>
    		        <string>%pathname%/vpop.app</string>
    		        <key>requirement</key>
    		        <string>anchor apple generic and identifier "com.electron.vpop" and (certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "5GBRFX6Y4M")</string>
    		    </dict>
    		</dict>
    </array>
</dict>
</plist>
