<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest WazuhAgent disk image.</string>
    <key>Identifier</key>
    <string>com.github.jeremylarose.download.WazuhAgent</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>WazuhAgent</string>
        <key>GITHUB_REPO</key>
    		<string>wazuh/wazuh</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.2</string>
    <key>Process</key>
    <array>
  		<dict>
  			<key>Arguments</key>
  			<dict>
  				<key>asset_regex</key>
  				<string>[\S]+.pkg</string>
  				<key>github_repo</key>
  				<string>%GITHUB_REPO%</string>
  			</dict>
  			<key>Processor</key>
  			<string>GitHubReleasesInfoProvider</string>
  		</dict>
  		<dict>
  			<key>Processor</key>
  			<string>URLDownloader</string>
  		</dict>
  		<dict>
  			<key>Processor</key>
  			<string>EndOfCheckPhase</string>
  		</dict>
  	</array>
</dict>
</plist>
