<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Brave.</string>
	<key>Identifier</key>
	<string>com.github.jeremylarose.download.Brave</string>
	<key>Input</key>
	<dict>
		<key>GITHUB_REPO</key>
		<string>brave/browser-laptop</string>
		<key>NAME</key>
		<string>Brave</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>asset_regex</key>
				<string>brave-[\S]+.dmg</string>
				<key>github_repo</key>
				<string>%GITHUB_REPO%</string>
			</dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
		    <key>Processor</key>
		    <string>EndOfCheckPhase</string>
		</dict>
		<dict>
		    <key>Processor</key>
		    <string>Unarchiver</string>
		    <key>Arguments</key>
		    <dict>
		        <key>archive_path</key>
		        <string>%pathname%</string>
		        <key>destination_path</key>
		        <string>%RECIPE_CACHE_DIR%/%NAME%</string>
		        <key>purge_destination</key>
		        <true/>
		    </dict>
		</dict>
		<dict>
		    <key>Processor</key>
		    <string>CodeSignatureVerifier</string>
		    <key>Arguments</key>
		    <dict>
		        <key>input_path</key>
		        <string>%RECIPE_CACHE_DIR%/%NAME%/Brave.app</string>
		        <key>requirement</key>
		        <string>anchor apple generic and identifier "com.electron.brave" and (certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "KL8N8XSYF4")</string>
		    </dict>
		</dict>
	</array>
</dict>
</plist>
