<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest SaltMinion 32-bit Windows installer.</string>
    <key>Identifier</key>
    <string>com.github.jeremylarose.download.Win.SaltMinion-x86</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>SaltMinion-x86</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.2</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://repo.saltstack.com/</string>
                <key>re_pattern</key>
                <string>href="https://repo.saltstack.com/windows/Salt-Minion-(?P&lt;version&gt;[\d\.]+)-Py3-x86-Setup.exe"</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://repo.saltstack.com/windows/Salt-Minion-%version%-Py3-x86-Setup.exe</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
