<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
   <dict>
      <key>Description</key>
      <string>Downloads the latest Bark Installer.</string>
      <key>Identifier</key>
      <string>com.github.jeremylarose.download.Bark</string>
      <key>MinimumVersion</key>
      <string>1.0.0</string>
      <key>Input</key>
      <dict>
         <key>NAME</key>
         <string>Bark</string>
         <key>DOWNLOADURL</key>
         <string>https://www.bark.us/download/mac/latest</string>
      </dict>
      <key>Process</key>
      <array>
         <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
               <key>url</key>
               <string>%DOWNLOADURL%</string>
               <key>filename</key>
               <string>%NAME%.dmg</string>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
         </dict>
				 <dict>
		 		    <key>Processor</key>
		 		    <string>CodeSignatureVerifier</string>
		 		    <key>Arguments</key>
		 		    <dict>
		 		        <key>input_path</key>
		 		        <string>%pathname%/Bark.app</string>
		 		        <key>requirement</key>
		 		        <string>identifier "us.bark.bark-desktop" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = LW4Y6RUWXV</string>
		 		    </dict>
		 		</dict>
				<dict>
            <key>Arguments</key>
            <dict>
                <key>info_path</key>
                <string>%pathname%/Bark.app/Contents/Info.plist</string>
                <key>plist_keys</key>
                <dict>
                    <key>CFBundleShortVersionString</key>
                    <string>version</string>
                </dict>
            </dict>
            <key>Processor</key>
            <string>PlistReader</string>
        </dict>
      </array>
   </dict>
</plist>
