<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of DYMO Connect and extracts a PKG.</string>
    <key>Identifier</key>
    <string>com.github.jeremylarose.pkg.DYMOConnect-intel</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>DYMOConnect-intel</string>
    </dict>
    <key>MinimumVersion</key>
    <string>2.3.0</string>
    <key>ParentRecipe</key>
    <string>com.github.jeremylarose.download.DYMOConnect-intel</string>
    <key>Process</key>
    <array>
    <dict>
        <key>Arguments</key>
        <dict>
            <key>destination_path</key>
            <string>%RECIPE_CACHE_DIR%/expanded</string>
            <key>flat_pkg_path</key>
            <string>%pathname%</string>
        </dict>
        <key>Processor</key>
        <string>FlatPkgUnpacker</string>
    </dict>
    <dict>
        <key>Arguments</key>
        <dict>
            <key>destination_path</key>
            <string>%RECIPE_CACHE_DIR%/payload</string>
            <key>pkg_payload_path</key>
            <string>%RECIPE_CACHE_DIR%/expanded/dymo-connect.pkg/Payload</string>
        </dict>
        <key>Processor</key>
        <string>PkgPayloadUnpacker</string>
    </dict>
    <dict>
        <key>Arguments</key>
        <dict>
            <key>info_path</key>
            <string>%RECIPE_CACHE_DIR%/payload/Applications/DYMO Connect.app/Contents/Info.plist</string>
            <key>plist_keys</key>
            <dict>
    					<key>CFBundleShortVersionString</key>
    					<string>version</string>
    				</dict>
        </dict>
        <key>Processor</key>
        <string>PlistReader</string>
    </dict>
    <dict>
        <key>Arguments</key>
        <dict>
            <key>source_pkg</key>
            <string>%pathname%</string>
            <key>pkg_path</key>
            <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
        </dict>
        <key>Processor</key>
        <string>PkgCopier</string>
    </dict>
    <dict>
        <key>Arguments</key>
        <dict>
            <key>path_list</key>
            <array>
    					<string>%RECIPE_CACHE_DIR%/expanded</string>
    					<string>%RECIPE_CACHE_DIR%/payload</string>
    				</array>
        </dict>
        <key>Processor</key>
        <string>PathDeleter</string>
    </dict>
    </array>
</dict>
</plist>
