<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest DYMO Connect package.</string>
    <key>Identifier</key>
    <string>com.github.jeremylarose.download.DYMOConnect-intel</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>DYMOConnect-intel</string>
    </dict>
    <key>MinimumVersion</key>
    <string>2.3.0</string>
    <key>Process</key>
    <array>
    <dict>
        <key>Processor</key>
        <string>URLTextSearcher</string>
        <key>Arguments</key>
        <dict>
            <key>url</key>
            <string>https://formulae.brew.sh/api/cask/dymo-connect.json</string>
            <key>re_pattern</key>
            <string>\"version\":\"(?P&lt;version&gt;[\d\.]+)\"</string>
        </dict>
    </dict>
    <dict>
        <key>Processor</key>
        <string>URLDownloader</string>
        <key>Arguments</key>
        <dict>
            <key>url</key>
            <string>https://dymoreleasecontent.blob.core.windows.net/dymo-release/DCDMAC/DCDMac%version%-X64.pkg</string>
        </dict>
    </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Sanford, L.P. (N3S6676K3E)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>
