<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest AdobeFlashPlayer ActiveX, NPAPI, and PPAPI</string>
	<key>Identifier</key>
	<string>com.github.jeremylarose.download.Win.AdobeFlashPlayer</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>AdobeFlashPlayer</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
				<key>Processor</key>
				<string>URLTextSearcher</string>
				<key>Arguments</key>
				<dict>
						<key>url</key>
						<string>http://fpdownload2.macromedia.com/get/flashplayer/update/current/xml/version_en_win_pl.xml</string>
						<key>re_pattern</key>
						<string>version="(?P&lt;major_version&gt;[0-9]+),(?P&lt;v2&gt;[0-9]+),(?P&lt;v3&gt;[0-9]+),(?P&lt;v4&gt;[0-9]+)"</string>
				</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
        <key>download_dir</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%major_version%.%v2%.%v3%.%v4%</string>
				<key>filename</key>
				<string>AdobeFlashPlayer-NPAPI-%major_version%.%v2%.%v3%.%v4%.exe</string>
				<key>url</key>
				<string>http://fpdownload.adobe.com/get/flashplayer/pdc/%major_version%.%v2%.%v3%.%v4%/install_flash_player.exe</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>download_dir</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%major_version%.%v2%.%v3%.%v4%</string>
				<key>filename</key>
				<string>AdobeFlashPlayer-PPAPI-%major_version%.%v2%.%v3%.%v4%.exe</string>
				<key>url</key>
				<string>http://fpdownload.adobe.com/get/flashplayer/pdc/%major_version%.%v2%.%v3%.%v4%/install_flash_player_ppapi.exe</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>download_dir</key>
				<string>%RECIPE_CACHE_DIR%/downloads</string>
				<key>filename</key>
				<string>AdobeFlashPlayer-ActiveX-%major_version%.%v2%.%v3%.%v4%.exe</string>
				<key>url</key>
				<string>http://fpdownload.adobe.com/get/flashplayer/pdc/%major_version%.%v2%.%v3%.%v4%/install_flash_player_ax.exe</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
