<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Download recipe for MongoDB Community Edition.

Values for ARCH include:
- "x86_64" (default, Intel)
- "arm64" (Apple Silicon)
</string>
        <key>Identifier</key>
        <string>com.github.jeremylarose.download.MongoDB-arm64</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>MongoDB-arm64</string>
            <key>ARCH</key>
            <string>arm64</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.3.1</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>URLTextSearcher</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>https://www.mongodb.com/try/download/community-edition/releases</string>
                    <key>re_pattern</key>
                    <string>"(https://fastdl.mongodb.org/osx/mongodb-macos-%ARCH%-(?P&lt;version&gt;[\d\.]+)\.tgz)"</string>
                    <key>result_output_var_name</key>
                    <string>url</string>
                </dict>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>filename</key>
                    <string>%NAME%-%version%-%ARCH%.tgz</string>
                </dict>
                <key>Processor</key>
                <string>URLDownloader</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
        </array>
    </dict>
</plist>
