<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest iTunes for Windows</string>
	<key>Identifier</key>
	<string>com.github.jeremylarose.download.Win.iTunes</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>iTunes</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
				<key>Processor</key>
				<string>URLTextSearcher</string>
				<key>Arguments</key>
				<dict>
						<key>url</key>
						<string>https://www.apple.com/itunes/download/</string>
						<key>re_pattern</key>
						<string>iTunes(?P&lt;version&gt;[\d\.]+).dmg</string>
				</dict>
		</dict>
		<dict>
				<key>Processor</key>
				<string>URLTextSearcher</string>
				<key>Arguments</key>
				<dict>
						<key>url</key>
						<string>https://www.apple.com/itunes/download/</string>
						<key>re_pattern</key>
						<string>https://secure-appldnld.apple.com/itunes(?P&lt;major_version&gt;[0-9]+)/(?P&lt;folder_x64&gt;[\S]+)/iTunes64Setup.exe</string>
				</dict>
		</dict>
		<dict>
				<key>Processor</key>
				<string>URLTextSearcher</string>
				<key>Arguments</key>
				<dict>
						<key>url</key>
						<string>https://www.apple.com/itunes/download/</string>
						<key>re_pattern</key>
						<string>https://secure-appldnld.apple.com/itunes(?P&lt;major_version&gt;[0-9]+)/(?P&lt;folder_x86&gt;[\S]+)/iTunesSetup.exe</string>
				</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%-x64.exe</string>
				<key>url</key>
				<string>https://secure-appldnld.apple.com/itunes%major_version%/%folder_x64%/iTunes64Setup.exe</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%-x86.exe</string>
				<key>url</key>
				<string>https://secure-appldnld.apple.com/itunes%major_version%/%folder_x86%/iTunesSetup.exe</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
