<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download the latest version of DYMO Connect Software and imports it into Munki.</string>
    <key>Identifier</key>
    <string>com.github.jeremylarose.munki.DYMOConnect</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/dymo</string>
        <key>NAME</key>
        <string>DYMOConnect</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>Peripherals</string>
            <key>developer</key>
            <string>DYMO</string>
            <key>display_name</key>
            <string>DYMO Connect</string>
            <key>category</key>
            <string>Printer and Scanner Software</string>
            <key>description</key>
            <string>DYMO Connect for Desktop software allows you to quickly create and print labels to your DYMO Label printer.</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>postinstall_script</key>
      	    <string>#!/bin/zsh
# cleanup
if [ -e "/Library/LaunchDaemons/com.dymo.pnpd.plist" ]; then
    launchctl unload -w /Library/LaunchDaemons/com.dymo.pnpd.plist
    rm -f /Library/LaunchDaemons/com.dymo.pnpd.plist
fi
if [ -e "/Library/LaunchAgents/com.dymo.dcd.webservice.plist" ]; then
    launchctl unload -w /Library/LaunchAgents/com.dymo.dcd.webservice.plist
    rm -f /Library/LaunchAgents/com.dymo.dcd.webservice.plist
fi
if [ -d "/Applications/DYMO Connect Support Tool.app" ]; then
    rm -rf "/Applications/DYMO Connect Support Tool.app"
fi
if [ -d "/Applications/DYMO.WebApi.Mac.Host.app" ]; then
    rm -rf "/Applications/DYMO.WebApi.Mac.Host.app"
fi

# add privileged helper tool file
touch /Library/PrivilegedHelperTools/com.dymo.dymo-connect.helper

# optional allow standard users to install printers
#/usr/sbin/dseditgroup -o edit -n /Local/Default -a everyone -t group _lpadmin
      			</string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>ParentRecipe</key>
    <string>com.github.jeremylarose.pkg.DYMOConnect</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>version</key>
                    <string>%version%</string>
                </dict>
            </dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>installs</key>
                    <array>
                        <dict>
                            <key>CFBundleShortVersionString</key>
                            <string>%version%</string>
                            <key>path</key>
                            <string>/Applications/DYMO Connect.app</string>
                            <key>type</key>
                            <string>application</string>
                            <key>version_comparison_key</key>
                            <string>CFBundleShortVersionString</string>
                        </dict>
                    </array>
                </dict>
            </dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pkg_path%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
