<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest RemotixAgent disk image.</string>
    <key>Identifier</key>
    <string>com.github.jeremylarose.download.RemotixAgent</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>RemotixAgent</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.2</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://remotixcloud.com/downloads/</string>
                <key>re_pattern</key>
                <string>curr-vers[\D]+(?P&lt;version&gt;[\d\.]+)?</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
						  	<key>filename</key>
						  	<string>%NAME%-%version%.dmg</string>
								<key>url</key>
                <string>https://downloads.remotixcloud.com/rxagentmac/RemotixAgent.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
    				<key>Processor</key>
    				<string>CodeSignatureVerifier</string>
    				<key>Arguments</key>
    				<dict>
    						<key>input_path</key>
    						<string>%pathname%/Remotix Agent.pkg</string>
    						<key>expected_authority_names</key>
    						<array>
    								<string>Developer ID Installer: Nulana LTD</string>
    								<string>Developer ID Certification Authority</string>
    								<string>Apple Root CA</string>
    						</array>
    				</dict>
    		</dict>
    </array>
</dict>
</plist>
