<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Downloads the latest version of RemotixAgent and imports it into Munki</string>
	<key>Identifier</key>
	<string>com.github.jeremylarose.munki.RemotixAgent</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>RemotixAgent</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Install Remotix Agent on Mac you will connect remotely or manage via Remotix Cloud Hub.</string>
			<key>category</key>
			<string>Support</string>
			<key>developer</key>
			<string>Nulana LTD</string>
			<key>display_name</key>
			<string>Remotix Agent</string>
			<key>minimum_os_version</key>
			<string>10.9.0</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>uninstall_method</key>
	    <string>uninstall_script</string>
	    <key>uninstall_script</key>
	    <string>#!/bin/bash
      launchctl unload /Library/LaunchDaemons/com.nulana.rxagentmac.daemon.plist
      killall Remotix\ Agent
			rm -rf /Applications/Remotix\ Agent.app
			rm -rf /Library/Application\ Support/com.nulana.rxagentmac /Library/LaunchDaemons/com.nulana.rxagentmac.daemon.plist /Library/LaunchAgents/com.nulana.rxagentmac.user.plist
			rm -rf /Library/Logs/com.nulana.rxagentmac
			pkgutil --forget com.nulana.rxagentmac.daemon
			pkgutil --forget com.nulana.rxagentmac</string>
	<key>uninstallable</key>
	<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.jeremylarose.pkg.RemotixAgent</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
							  <key>pkg_path</key>
							  <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
