<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Remotix Agent and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.jeremylarose.pkg.RemotixAgent</string>
	<key>Input</key>
	<dict>
		<key>BUNDLE_ID</key>
		<string>com.nulana.rxagentmac</string>
		<key>NAME</key>
		<string>RemotixAgent</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.jeremylarose.download.RemotixAgent</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>target</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
				<key>source</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%-%version%.dmg/Remotix Agent.pkg</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
	</array>
</dict>
</plist>
