<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Creates a 7370 driver pack installer.</string>
	<key>Identifier</key>
	<string>com.github.jeremylarose.pkg.Win.DriverPack-7370-win10-x64</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>7370</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.jeremylarose.download.Win.DriverPack-7370-win10</string>
	<key>Process</key>
	<array>
		<dict>
		  <key>Processor</key>
		  <string>com.github.jeremylarose.SharedProcessors/CabExtractor</string>
			<key>Arguments</key>
			<dict>
					<key>cab_extract_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%-%platform%-%version%-%id%</string>
			</dict>
    </dict>
		<dict>
				<key>Processor</key>
				<string>URLTextSearcher</string>
				<key>Arguments</key>
				<dict>
						<key>url</key>
						<string>http://snappy-driver-installer.org/downloads.html</string>
						<key>re_pattern</key>
						<string>SDIO_R(?P&lt;sdi_version&gt;[\S]+).zip</string>
				</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>http://snappy-driver-installer.org/downloads/SDIO_R%sdi_version%.zip</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
			<key>Arguments</key>
			<dict>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/downloads</string>
			</dict>
		</dict>
		<dict>
		  <key>Processor</key>
		  <string>com.github.jeremylarose.SharedProcessors/PkgCreator7z</string>
			<key>Arguments</key>
			<dict>
				<key>install_flags</key>
				<string>-nogui -license -norestorepnt -nosnapshot -nologfile -keepunpackedindex -autoinstall -autoclose -PATH .</string>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/SDI_%sdi_version%/SDI_x64_R%sdi_version%.exe</string>
				<key>extra_files</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%platform%-%version%-%id%/%NAME%/Win10/x64</string>
				<key>pkg_name</key>
				<string>%NAME%-%platform%-%version%-%id%-X64.exe</string>
			</dict>
    </dict>
		<dict>
				<key>Processor</key>
				<string>PathDeleter</string>
				<key>Arguments</key>
				<dict>
						<key>path_list</key>
						<array>
								<string>%RECIPE_CACHE_DIR%/%NAME%-%platform%-%version%-%id%</string>
						</array>
				</dict>
		</dict>
		<dict>
				<key>Processor</key>
				<string>FileCreator</string>
				<key>Arguments</key>
				<dict>
						<key>file_path</key>
						<string>%RECIPE_CACHE_DIR%/%NAME%-%platform%-%version%-%id%</string>
						<key>file_content</key>
						<string>cab was extracted and packaged, then the extracted path was deleted to save space</string>
				</dict>
		</dict>
	</array>
</dict>
</plist>
