<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Downloads the latest Adobe Acrobat Pro 2020 Update and imports it into Munki</string>
	<key>Identifier</key>
	<string>com.github.jeremylarose.munki.AdobeAcrobatPro2020Update</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>AdobeAcrobatPro2020Update</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Update for Adobe Acrobat Pro 2020</string>
			<key>category</key>
			<string>Productivity</string>
			<key>developer</key>
			<string>Adobe</string>
			<key>display_name</key>
			<string>Adobe Acrobat Pro 2020 Update</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>blocking_applications</key>
			<string>Adobe Acrobat</string>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.jeremylarose.pkg.AdobeAcrobatPro2020Update</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Comment</key>
            <string>Import the pkg into Munki!</string>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
						  	<key>pkg_path</key>
						  	<string>%RECIPE_CACHE_DIR%/%NAME%-20.%mid_version%.%minor_version%.pkg</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
