<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Chromium OS X stable FreeSMUG build disk image.</string>
    <key>Identifier</key>
    <string>com.github.jeremylarose.download.Chromium</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Chromium</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.2</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://sourceforge.net/projects/osxportableapps/files/Chromium/</string>
                <key>re_pattern</key>
                <string>Chromium_(?P&lt;os&gt;[\S]+)_(?P&lt;version&gt;[\d\.]+).dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://downloads.sourceforge.net/project/osxportableapps/Chromium/Chromium_%os%_%version%.dmg</string>
            </dict>
        </dict>

        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
    				<key>Processor</key>
    				<string>CodeSignatureVerifier</string>
    				<key>Arguments</key>
    				<dict>
    						<key>input_path</key>
    						<string>%pathname%/Chromium.app</string>
    						<key>expected_authority_names</key>
    						<array>
    								<string>Developer ID Application: Carlo Gandolfi (66KW43FE5Q)</string>
    								<string>Developer ID Certification Authority</string>
    								<string>Apple Root CA</string>
    						</array>
    				</dict>
    		</dict>
    </array>
</dict>
</plist>
