<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest QSyncthingTray disk image.</string>
    <key>Identifier</key>
    <string>com.github.jeremylarose.download.QSyncthingTray</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>QSyncthingTray</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.2</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://github.com/sieren/QSyncthingTray/releases</string>
                <key>re_pattern</key>
                <string>href="/sieren/QSyncthingTray/releases/download/(?P&lt;major_version&gt;[\d\.]+)/QSyncthingTray_(?P&lt;full_version&gt;[\d\.]+)_MAC.dmg"</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%-%full_version%.dmg</string>
                <key>url</key>
                <string>https://github.com/sieren/QSyncthingTray/releases/download/%major_version%/QSyncthingTray_%full_version%_MAC.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
