<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Slack x86 and x64 installers.</string>
	<key>Identifier</key>
	<string>com.github.jeremylarose.download.Win.Slack</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Slack</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
				<key>Processor</key>
				<string>URLTextSearcher</string>
				<key>Arguments</key>
				<dict>
						<key>url</key>
						<string>https://slack.com/release-notes/windows/rss</string>
						<key>re_pattern</key>
						<string>prod/ia32/slack-standalone-(?P&lt;version&gt;[\d\.]+).msi</string>
				</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%-x64.msi</string>
				<key>url</key>
				<string>https://downloads.slack-edge.com/releases/windows/4.8.0/prod/x64/slack-standalone-%version%.msi</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%.msi</string>
				<key>url</key>
				<string>https://downloads.slack-edge.com/releases/windows/4.8.0/prod/ia32/slack-standalone-%version%.msi</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
