<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads EndNoteX8 and the latest update, then installs or updates accordingly.</string>
	<key>Identifier</key>
	<string>com.github.jeremylarose.pkg.Win.EndNoteX8</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>EndNoteX8</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.jeremylarose.download.Win.EndNoteX8</string>
	<key>Process</key>
	<array>
		<dict>
				<key>Processor</key>
				<string>FileCreator</string>
				<key>Arguments</key>
				<dict>
						<key>file_path</key>
						<string>%RECIPE_CACHE_DIR%/install.bat</string>
						<key>file_content</key>
						<string>@echo off

cls
echo ----------------------------------------------------------------
echo .
echo .
echo .       Installing EndNoteX8 and/or Updates - Please Wait
echo .              Window will close once installed
echo .
echo .
echo ----------------------------------------------------------------

:: check if installed at all, if is, go to updates
IF EXIST "C:\Program Files (x86)\EndNote X8\EndNote.exe" GOTO UPDATE
IF EXIST "C:\Program Files\EndNote X8\EndNote.exe" GOTO UPDATE

:: install EndNoteX8
msiexec /i %~dp0ENX8Inst.msi /qn

:UPDATE
						</string>
				</dict>
		</dict>
		<dict>
		  <key>Processor</key>
		  <string>com.github.jeremylarose.SharedProcessors/PkgCreator7z</string>
			<key>Arguments</key>
			<dict>
				<key>install_flags</key>
				<string>/qn /norestart</string>
				<key>input_bat_path</key>
				<string>%RECIPE_CACHE_DIR%/install.bat</string>
				<key>extra_files</key>
				<string>%RECIPE_CACHE_DIR%/downloads/ENX8Inst.msi</string>
				<key>pkg_name</key>
				<string>%NAME%-8.%version%.exe</string>
			</dict>
    </dict>
		<dict>
				<key>Processor</key>
				<string>PathDeleter</string>
				<key>Arguments</key>
				<dict>
						<key>path_list</key>
						<array>
								<string>%RECIPE_CACHE_DIR%/install.bat</string>
						</array>
				</dict>
		</dict>
	</array>
</dict>
</plist>
