<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of 7zip 64-Bit.</string>
	<key>Identifier</key>
	<string>com.github.jeremylarose.download.win.7zip</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>7zip</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
				<key>Processor</key>
				<string>URLTextSearcher</string>
				<key>Arguments</key>
				<dict>
						<key>url</key>
						<string>http://www.7-zip.org/download.html</string>
						<key>re_pattern</key>
						<string>Download[\s]7-Zip[\s](?P&lt;major_version&gt;[0-9]+).(?P&lt;minor_version&gt;[0-9]+)[\s]</string>
				</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%major_version%.%minor_version%-x64.exe</string>
				<key>url</key>
				<string>http://www.7-zip.org/a/7z%major_version%%minor_version%-x64.exe</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%major_version%.%minor_version%.exe</string>
				<key>url</key>
				<string>http://www.7-zip.org/a/7z%major_version%%minor_version%.exe</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
