<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest iTunes, extracts, and creates silent installer.</string>
	<key>Identifier</key>
	<string>com.github.jeremylarose.pkg.Win.iTunes</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>iTunes</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.jeremylarose.download.Win.iTunes</string>
	<key>Process</key>
	<array>
		<dict>
				<key>Processor</key>
				<string>FileCreator</string>
				<key>Arguments</key>
				<dict>
						<key>file_path</key>
						<string>%RECIPE_CACHE_DIR%/downloads/nop.exe</string>
						<key>file_content</key>
						<string>nothing to see here</string>
				</dict>
		</dict>
		<dict>
		  <key>Processor</key>
		  <string>com.github.jeremylarose.SharedProcessors/Unarchiver7z</string>
			<key>Arguments</key>
			<dict>
	  		<key>extract_path</key>
		  	<string>%RECIPE_CACHE_DIR%/downloads/%NAME%-%version%</string>
			</dict>
    </dict>
		<dict>
		  <key>Processor</key>
		  <string>com.github.jeremylarose.SharedProcessors/Unarchiver7z</string>
			<key>Arguments</key>
			<dict>
	  		<key>extract_path</key>
		  	<string>%RECIPE_CACHE_DIR%/downloads/%NAME%-%version%/x64</string>
				<key>archive_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%-%version%-x64.exe</string>
			</dict>
    </dict>
		<dict>
				<key>Processor</key>
				<string>FileCreator</string>
				<key>Arguments</key>
				<dict>
						<key>file_path</key>
						<string>%RECIPE_CACHE_DIR%/install.bat</string>
						<key>file_content</key>
						<string>@echo off

:: quit installer if application is running, else continue....
tasklist.exe /FI "IMAGENAME eq iTunes.exe" 2>NUL | find /I /N "iTunes.exe" || goto notrunning
EXIT
:notrunning

cls
echo --------------------------------------------------------
echo .
echo .
echo .            Installing iTunes - Please Wait
echo .           Window will close once installed
echo .
echo .
echo --------------------------------------------------------

::Install 64-bit for 64-Bit systems and 32-Bit for 32-Bit Systems
IF NOT EXIST "C:\Program Files (x86)" GOTO x86install
pushd "%~dp0"
msiexec /i %NAME%-%version%\x64\AppleApplicationSupport64.msi /qn /norestart
msiexec /i %NAME%-%version%\x64\iTunes64.msi /qn /norestart
msiexec /i %NAME%-%version%\x64\AppleMobileDeviceSupport6464.msi /qn /norestart
msiexec /i %NAME%-%version%\x64\Bonjour64.msi /qn /norestart
popd
EXIT

:x86install

pushd "%~dp0"
msiexec /i %NAME%-%version%\AppleApplicationSupport.msi /qn /norestart
msiexec /i %NAME%-%version%\iTunes.msi /qn /norestart
msiexec /i %NAME%-%version%\AppleMobileDeviceSupport.msi /qn /norestart
msiexec /i %NAME%-%version%\Bonjour.msi /qn /norestart
popd
						</string>
				</dict>
		</dict>
		<dict>
		  <key>Processor</key>
		  <string>com.github.jeremylarose.SharedProcessors/PkgCreator7z</string>
			<key>Arguments</key>
			<dict>
				<key>install_flags</key>
				<string>REM</string>
				<key>input_bat_path</key>
				<string>%RECIPE_CACHE_DIR%/install.bat</string>
				<key>extra_files</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%-%version%</string>
				<key>pkg_name</key>
				<string>%NAME%-%version%.exe</string>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/nop.exe</string>
			</dict>
    </dict>
		<dict>
				<key>Processor</key>
				<string>PathDeleter</string>
				<key>Arguments</key>
				<dict>
						<key>path_list</key>
						<array>
								<string>%RECIPE_CACHE_DIR%/install.bat</string>
						</array>
				</dict>
		</dict>
		<dict>
				<key>Processor</key>
				<string>PathDeleter</string>
				<key>Arguments</key>
				<dict>
						<key>path_list</key>
						<array>
								<string>%RECIPE_CACHE_DIR%/downloads/%NAME%-%version%</string>
						</array>
				</dict>
		</dict>
		<dict>
				<key>Processor</key>
				<string>PathDeleter</string>
				<key>Arguments</key>
				<dict>
						<key>path_list</key>
						<array>
								<string>%RECIPE_CACHE_DIR%/downloads/nop.exe</string>
						</array>
				</dict>
		</dict>
		<dict>
				<key>Processor</key>
				<string>FileCreator</string>
				<key>Arguments</key>
				<dict>
						<key>file_path</key>
						<string>%RECIPE_CACHE_DIR%/downloads/%NAME%-%version%</string>
						<key>file_content</key>
						<string>installer was extracted and packaged, then the extracted path was deleted to save space</string>
				</dict>
		</dict>
	</array>
</dict>
</plist>
