<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest iTunes, extracts, and creates silent installer.</string>
	<key>Identifier</key>
	<string>com.github.jeremylarose.pkg.Win.iTunes</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>iTunes</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.jeremylarose.download.Win.iTunes</string>
	<key>Process</key>
	<array>
		<dict>
		  <key>Processor</key>
		  <string>com.github.jeremylarose.SharedProcessors/Unarchiver7z</string>
    </dict>
		<dict>
		  <key>Processor</key>
		  <string>com.github.jeremylarose.SharedProcessors/Unarchiver7z</string>
			<key>Arguments</key>
			<dict>
	  		<key>extract_path</key>
		  	<string>%RECIPE_CACHE_DIR%/downloads/%NAME%-%version%</string>
				<key>archive_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%-%version%-x64</string>
			</dict>
    </dict>
	</array>
</dict>
</plist>
