Description: Downloads the latest EndNote 20 updates and unzips the contents.
Identifier: com.github.jeremylarose.download.EndNote20Updates
MinimumVersion: "2.3"

Input:
  NAME: EndNote
  INT_VERSION: "20"
  MAJOR_VERSION: "20"
  version: latest

Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: (/updates/%INT_VERSION%.0/EndNote%MAJOR_VERSION%[0-9]*UpdateInstaller.zip)
      url: http://download.endnote.com/updates/%INT_VERSION%.0/EN%INT_VERSION%MacUpdates.xml

  - Processor: URLDownloader
    Arguments:
      filename: "%NAME%.zip"
      url: http://download.endnote.com%match%

  - Processor: EndOfCheckPhase

  - Processor: Unarchiver
    Arguments:
      archive_path: "%pathname%"
      destination_path: "%RECIPE_CACHE_DIR%/%NAME%-%MAJOR_VERSION%"
      purge_destination: true

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%RECIPE_CACHE_DIR%/%NAME%-%MAJOR_VERSION%/*/*.app"
      requirement: anchor trusted

  - Processor: URLTextSearcher
    Arguments:
      re_pattern: (updateTo\>(?P<version>%INT_VERSION%.*?)\<\/updateTo)
      url: http://download.endnote.com/updates/%INT_VERSION%.0/EN%INT_VERSION%MacUpdates.xml
