<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest Adobe Reader DC.</string>
	<key>Identifier</key>
	<string>com.github.jeremylarose.download.Win.AdobeReaderDC</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>AdobeReaderDC</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
				<key>Processor</key>
				<string>URLTextSearcher</string>
				<key>Arguments</key>
				<dict>
						<key>url</key>
						<string>https://supportdownloads.adobe.com/product.jsp?product=10&platform=Windows</string>
						<key>re_pattern</key>
						<string>Version[\s]20(?P&lt;major_version&gt;[0-9]+).(?P&lt;mid_version&gt;[0-9]+).(?P&lt;minor_version&gt;[0-9]+)</string>
				</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%major_version%.%mid_version%.%minor_version%.exe</string>
				<key>url</key>
				<string>http://ardownload.adobe.com/pub/adobe/reader/win/AcrobatDC/%major_version%%mid_version%/AcroRdrDC%major_version%.%mid_version%.%minor_version%_en_US.exe</string>
				<key>download_dir</key>
				<string>%RECIPE_CACHE_DIR%/downloads</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
