<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.4 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of syncthing.</string>
	<key>Identifier</key>
	<string>com.github.jeremylarose.download.syncthing</string>
	<key>Input</key>
	<dict>
		<key>DOWNLOAD_URL</key>
		<string>https://github.com/syncthing/syncthing/releases/download/v0.14.16/syncthing-macosx-amd64-v0.14.16.tar.gz</string>
		<key>NAME</key>
		<string>syncthing</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
             <dict>
		<key>Arguments</key>
		<dict>
		    <key>filename</key>
		    <string>syncthing-macosx-amd64-v0.14.16.tar.gz</string>
		    <key>url</key>
		    <string>%DOWNLOAD_URL%</string>
	        </dict>
                <key>Processor</key>
	        <string>URLDownloader</string>
	     </dict>
	     <dict>
	         <key>Processor</key>
	         <string>EndOfCheckPhase</string>
	     </dict>
	     <dict>
		 <key>Arguments</key>
                 <dict>
		     <key>archive_path</key>
		     <string>%pathname%</string>
		     <key>destination_path</key>
		     <string>%RECIPE_CACHE_DIR%/%NAME%/Applications</string>
		     <key>purge_destination</key>
		     <true/>
	         </dict>
	         <key>Processor</key>
	         <string>Unarchiver</string>
            </dict>
            <dict>
		<key>Arguments</key>
		<dict>
		    <key>input_path</key>
	            <string>%RECIPE_CACHE_DIR%/%NAME%/Applications/syncthing</string>
	        </dict>
	     </dict>
	 </array>
</dict>
</plist>
