<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Syncthing.</string>
	<key>Identifier</key>
	<string>com.github.jeremylarose.download.Syncthing</string>
	<key>Input</key>
	<dict>
		<key>GITHUB_REPO</key>
		<string>syncthing/syncthing</string>
		<key>NAME</key>
		<string>Syncthing</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>asset_regex</key>
				<string>syncthing-macosx-amd64-v[0-9.]+.tar.gz</string>
				<key>github_repo</key>
				<string>%GITHUB_REPO%</string>
			</dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%.tar.gz</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.tar.gz</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%</string>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_root</key>
				<string>%RECIPE_CACHE_DIR%/syncthing-macosx-amd64-v%version%</string>
				<key>dmg_path</key>
				<string>%RECIPE_CACHE_DIR%</string>
			</dict>
			<key>Processor</key>
			<string>DMGCreator</string>
		</dict>
	</array>
</dict>
</plist>
