<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Installs the latest version of Syncthing.</string>
	<key>Identifier</key>
	<string>com.github.jeremylarose.install.Syncthing</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Syncthing</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>ParentRecipe</key>
	<string>com.github.jeremylarose.download.Syncthing</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/syncthing-macos-amd64-v%version%/syncthing</string>
				<key>destination_path</key>
				<string>/usr/local/bin/</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
	</array>
</dict>
</plist>
