<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Creates an 3020 BIOS installer.</string>
	<key>Identifier</key>
	<string>com.github.jeremylarose.pkg.Win.BIOS-3020</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>3020</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.jeremylarose.download.Win.BIOS-3020</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
		  <key>Processor</key>
		  <string>com.github.jeremylarose.SharedProcessors/PkgCreator7z</string>
			<key>Arguments</key>
			<dict>
				<key>install_flags</key>
				<string>/s</string>
				<key>pkg_name</key>
				<string>%NAME%-%version%.exe</string>
			</dict>
    </dict>
	</array>
</dict>
</plist>
