<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Paint.NET and creates a silent installer.</string>
	<key>Identifier</key>
	<string>com.github.jeremylarose.pkg.Win.Paint.NET</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Paint.NET</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.jeremylarose.download.Win.Paint.NET</string>
	<key>Process</key>
	<array>
		<dict>
				<key>Processor</key>
				<string>FileCreator</string>
				<key>Arguments</key>
				<dict>
						<key>file_path</key>
						<string>%RECIPE_CACHE_DIR%/downloads/install.bat</string>
						<key>file_content</key>
						<string>@echo off

:: quit installer if application is running....
tasklist.exe /FI "IMAGENAME eq PaintDotNet.exe" 2>NUL | find /I /N "PaintDotNet.exe" || goto continue
EXIT
:continue

cls
echo --------------------------------------------------------
echo .
echo .
echo .          Installing Paint.net - Please Wait
echo .           Window will close once installed
echo .
echo .
echo --------------------------------------------------------
						</string>
				</dict>
		</dict>
		<dict>
		  <key>Processor</key>
		  <string>com.github.jeremylarose.SharedProcessors/PkgCreator7z</string>
			<key>Arguments</key>
			<dict>
				<key>install_flags</key>
				<string>/auto DESKTOPSHORTCUT=0 CHECKFORUPDATES=0 JPGPNGBMPEDITOR=0</string>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%-%version%.exe</string>
				<key>pkg_name</key>
				<string>%NAME%-%version%.exe</string>
				<key>input_bat_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/install.bat</string>
			</dict>
    </dict>
		<dict>
				<key>Processor</key>
				<string>PathDeleter</string>
				<key>Arguments</key>
				<dict>
						<key>path_list</key>
						<array>
								<string>%RECIPE_CACHE_DIR%/downloads/install.bat</string>
						</array>
				</dict>
		</dict>
	</array>
</dict>
</plist>
