<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of MinKNOW-UI-arm and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.jeremylarose.munki.MinKNOW-UI-arm</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>MinKNOW-UI-arm</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Tools</string>
			<key>description</key>
			<string>Previously known as MinKNOW Standalone GUI. Stand-alone GUI for use when remote accessing devices. This cannot run MinION Mk1b or P2 Solo Devices - use MinKNOW Software for the MinION Mk1B and the PromethION 2 Solo (P2 Solo) Devices instead</string>
			<key>developer</key>
			<string>Oxford Nanopore Technologies plc</string>
			<key>display_name</key>
			<string>MinKNOW UI</string>
			<key>minimum_os_version</key>
			<string>10.12.0</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
            <key>supported_architectures</key>
            <array>
                <string>arm64</string>
            </array>
            <key>installable_condition</key>
			<string>NOT arch BEGINSWITH "arm"</string>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.jeremylarose.download.MinKNOW-UI-arm</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
