<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest verison of ScanSnap Home</string>
    <key>Identifier</key>
    <string>com.github.jeremylarose.download.scansnaphome</string>
    <key>Input</key>
	<dict>
		<key>NAME</key>
		<string>ScanSnap Home</string>
		<key>SEARCH_URL</key>
		<string>https://www.pfu.ricoh.com/global/scanners/scansnap/dl/mac-sshoffline.html</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.0.0</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>ScanSnap Home Offline Installer (?P&lt;major&gt;[\d])\.(?P&lt;minor&gt;[\d])\.(?P&lt;patch&gt;[\d]+)</string>
            </dict>
        </dict>
        <dict>
        	<key>Processor</key>
        	<string>URLDownloader</string>
        	<key>Arguments</key>
        	<dict>
        	   <key>url</key>
        	   <string>https://origin.pfultd.com/downloads/ss/sshinst/m-%major%%minor%%patch%/MacSSHOfflineInstaller_%major%_%minor%_%patch%.dmg</string>
        	   <key>filename</key>
        	   <string>%NAME%.dmg</string>
        	</dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%/Download/MacSSHomeInstaller_%major%_%minor%_%patch%.dmg</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-Installer.dmg</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-Installer.dmg/%NAME%.pkg</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: PFU LIMITED (XW4U7W2E9L)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
        </dict>
	</array>
</dict>
</plist>
