<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of ScanSnapHome and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.jeremylarose.pkg.ScanSnapHome</string>
	<key>Input</key>
	<dict>
		<key>BUNDLE_ID</key>
		<string>jp.co.pfu.ScanSnap.P2IUNISET</string>
		<key>NAME</key>
		<string>ScanSnapHome</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.jeremylarose.download.ScanSnapHome</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>InstallFromDMG</string>
			<key>Arguments</key>
			<dict>
					<key>dmg_path</key>
					<string>%pathname%/Download/MacSSHomeInstaller_%major%%_%minor%_%latest%.dmg</string>
					<key>items_to_copy</key>
					<array>
							<dict>
									<key>source_item</key>
									<string>ScanSnap Home.pkg</string>
									<key>destination_path</key>
									<string>%RECIPE_CACHE_DIR%/%NAME%-%major%.%minor%.%latest%.pkg</string>
							</dict>
					</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
